export const StatusInfo: Record<string, { name: string; description: string, color: string}> = {
  poison: { name: 'Яд', description: 'Копится стаками. Каждые 100 стаков дают одну порцию периодического урона.', color: '#43FF00'},
  stun: { name: 'Оглушение', description: 'Цель временно не может выполнять свои действия.', color: '#808080'},
  /*
  bleed: { name: 'Кровотечение', description: 'Периодически наносит физический урон. Чем больше стаков, тем сильнее тик.' },
  burn: { name: 'Поджог', description: 'Периодически наносит огненный урон.' },
  chill: { name: 'Окоченение', description: 'Холодный эффект. Используется предметами и способностями для замедляющего давления.' },
  blind: { name: 'Ослепление', description: 'Цель с высокой вероятностью промахивается атакой.' },
  dizzy: { name: 'Головокружение', description: 'Делает цель уязвимой к некоторым атакам врагов.' },
  hex: { name: 'Сглаз', description: 'Цель получает больше входящего урона.' },
  madness: { name: 'Безумие', description: 'Ускоряет действия, но мешает нормально учитывать защиту.' },
  antiheal: { name: 'Запрет лечения', description: 'Цель не может восстанавливать здоровье.' },
  shield: { name: 'Щит', description: 'Поглощает часть входящего урона.' },
  slow: { name: 'Замедление', description: 'Замедляет заполнение таймеров действий.' },
  invulnerable: { name: 'Неуязвимость', description: 'Цель временно не получает урон.' }
*/
  };